# Lesson 1: Data Munging Basics Practice Space

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

### A. Filtering and Selecting data

In [2]:
series_obj = Series(np.arange(6), index=['r1','r2','r3','r4','r5','r6'])
series_obj

r1    0
r2    1
r3    2
r4    3
r5    4
r6    5
dtype: int32

In [3]:
series_obj['r2']

1

In [4]:
series_obj[[2,3,4]]

r3    2
r4    3
r5    4
dtype: int32

In [5]:
np.random.seed(25)
df_obj = DataFrame(np.random.rand(36).reshape((6,6)),
                   index=['r1','r2','r3','r4','r5','r6'],
                   columns=['c1','c2','c3','c4','c5','r6'])
df_obj

          c1        c2        c3        c4        c5        r6
r1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
r4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
r5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
r6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [6]:
df_obj.ix[['r2','r4','r5'],['c1','c5']]

C:\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          c1        c5
r2  0.684969  0.402366
r4  0.366395  0.383048
r5  0.514244  0.421004

In [7]:
df_obj.loc[['r2','r4','r5'],['c1','c5']]

          c1        c5
r2  0.684969  0.402366
r4  0.366395  0.383048
r5  0.514244  0.421004

In [8]:
series_obj['r2':'r4']

r2    1
r3    2
r4    3
dtype: int32

In [9]:
df_obj['r2':'r4']

          c1        c2        c3        c4        c5        r6
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
r4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541

In [10]:
df_obj>.2

      c1    c2     c3     c4    c5     r6
r1  True  True   True  False  True  False
r2  True  True   True   True  True  False
r3  True  True  False   True  True   True
r4  True  True   True   True  True   True
r5  True  True  False   True  True   True
r6  True  True   True   True  True   True

In [11]:
series_obj[series_obj>=2]

r3    2
r4    3
r5    4
r6    5
dtype: int32

In [12]:
df_obj[df_obj<=.9]

          c1        c2        c3        c4        c5        r6
r1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
r4  0.366395  0.836375  0.481343  0.516502  0.383048       NaN
r5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
r6  0.281701       NaN  0.669612  0.456069  0.289804  0.525819

In [13]:
series_obj['r1','r3','r5']=15
series_obj

r1    15
r2     1
r3    15
r4     3
r5    15
r6     5
dtype: int32

In [14]:
df_obj.replace(to_replace={'c2':{'r1':0.582277,'r5':0.516502},'c5':{'r4':0.836375}},value=0.799186) # Not working as expected

          c1        c2        c3        c4        c5        r6
r1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
r4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
r5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
r6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [15]:
df_obj.replace(to_replace={'c2':{0.582277:0.699186}}, value=None) # Not working as expected

          c1        c2        c3        c4        c5        r6
r1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
r4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
r5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
r6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

### B. Treating missing values

In [16]:
missing = np.nan

series_obj_missing = Series([missing,'b',missing,'c',10,236,missing,'we'])
series_obj_missing

0    NaN
1      b
2    NaN
3      c
4     10
5    236
6    NaN
7     we
dtype: object

In [17]:
series_obj_missing.isnull()

0     True
1    False
2     True
3    False
4    False
5    False
6     True
7    False
dtype: bool

In [18]:
np.random.seed(35)

df_object_missing = DataFrame(np.random.randn(36).reshape(6,6,))
df_object_missing

          0         1         2         3         4         5
0 -1.889737 -0.413592 -0.766026 -0.924127 -1.421598  0.805256
1  1.148862  1.169428 -0.802009  0.722478  0.052987 -1.181520
2 -0.676151 -0.166227  0.467435  0.333719 -0.849658  0.068683
3  0.018582  1.315533  1.164775 -0.340329  0.056233  0.225879
4 -0.375620  0.553313 -1.370904  0.982643  0.288699 -1.597311
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [19]:
df_object_missing.loc[2:4,2]=missing
df_object_missing.loc[0,4]=missing
df_object_missing.loc[1:2,0]=missing
df_object_missing

          0         1         2         3         4         5
0 -1.889737 -0.413592 -0.766026 -0.924127       NaN  0.805256
1       NaN  1.169428 -0.802009  0.722478  0.052987 -1.181520
2       NaN -0.166227       NaN  0.333719 -0.849658  0.068683
3  0.018582  1.315533       NaN -0.340329  0.056233  0.225879
4 -0.375620  0.553313       NaN  0.982643  0.288699 -1.597311
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [20]:
filled_df_obj = df_object_missing.fillna(0)
filled_df_obj

          0         1         2         3         4         5
0 -1.889737 -0.413592 -0.766026 -0.924127  0.000000  0.805256
1  0.000000  1.169428 -0.802009  0.722478  0.052987 -1.181520
2  0.000000 -0.166227  0.000000  0.333719 -0.849658  0.068683
3  0.018582  1.315533  0.000000 -0.340329  0.056233  0.225879
4 -0.375620  0.553313  0.000000  0.982643  0.288699 -1.597311
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [21]:
filled_df_obj = df_object_missing.fillna({0:0.2,4:0.9})
filled_df_obj

          0         1         2         3         4         5
0 -1.889737 -0.413592 -0.766026 -0.924127  0.900000  0.805256
1  0.200000  1.169428 -0.802009  0.722478  0.052987 -1.181520
2  0.200000 -0.166227       NaN  0.333719 -0.849658  0.068683
3  0.018582  1.315533       NaN -0.340329  0.056233  0.225879
4 -0.375620  0.553313       NaN  0.982643  0.288699 -1.597311
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [22]:
ffill_df_obj = df_object_missing.ffill()
ffill_df_obj

          0         1         2         3         4         5
0 -1.889737 -0.413592 -0.766026 -0.924127       NaN  0.805256
1 -1.889737  1.169428 -0.802009  0.722478  0.052987 -1.181520
2 -1.889737 -0.166227 -0.802009  0.333719 -0.849658  0.068683
3  0.018582  1.315533 -0.802009 -0.340329  0.056233  0.225879
4 -0.375620  0.553313 -0.802009  0.982643  0.288699 -1.597311
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [23]:
ffill_df_obj = df_object_missing.fillna(method='ffill')
ffill_df_obj

          0         1         2         3         4         5
0 -1.889737 -0.413592 -0.766026 -0.924127       NaN  0.805256
1 -1.889737  1.169428 -0.802009  0.722478  0.052987 -1.181520
2 -1.889737 -0.166227 -0.802009  0.333719 -0.849658  0.068683
3  0.018582  1.315533 -0.802009 -0.340329  0.056233  0.225879
4 -0.375620  0.553313 -0.802009  0.982643  0.288699 -1.597311
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [24]:
#df_object_missing.loc[2:4,2]=missing
#df_object_missing.loc[0,4]=missing
#df_object_missing.loc[1:2,0]=missing
df_object_missing

          0         1         2         3         4         5
0 -1.889737 -0.413592 -0.766026 -0.924127       NaN  0.805256
1       NaN  1.169428 -0.802009  0.722478  0.052987 -1.181520
2       NaN -0.166227       NaN  0.333719 -0.849658  0.068683
3  0.018582  1.315533       NaN -0.340329  0.056233  0.225879
4 -0.375620  0.553313       NaN  0.982643  0.288699 -1.597311
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [25]:
df_object_missing.isnull().sum(axis=1) # for row based count

0    1
1    1
2    2
3    1
4    1
5    0
dtype: int64

In [26]:
df_object_missing.isnull().sum(axis=0) # for column based count Default is without arguments for column based

0    2
1    0
2    3
3    0
4    1
5    0
dtype: int64

In [27]:
df_drop_NaN = df_object_missing.dropna() # for row based deletion Default is without arguments for row based
df_drop_NaN

          0         1         2         3         4         5
5 -0.337045 -0.816795  1.079692  0.429162 -1.248063 -0.682136

In [28]:
df_drop_NaN = df_object_missing.dropna(axis=1) # for col based deletion
df_drop_NaN

          1         3         5
0 -0.413592 -0.924127  0.805256
1  1.169428  0.722478 -1.181520
2 -0.166227  0.333719  0.068683
3  1.315533 -0.340329  0.225879
4  0.553313  0.982643 -1.597311
5 -0.816795  0.429162 -0.682136

### C. Removing duplicates

In [29]:
dup_obj = DataFrame({'col1':[1,1,2,2,3,3,3],
                     'col2':['a','a','b','b','c','c','c'],
                     'col3':['A','A','B','B','C','C','C'],
                     'col4':['x','x','y','y','z','z','z']})
dup_obj

   col1 col2 col3 col4
0     1    a    A    x
1     1    a    A    x
2     2    b    B    y
3     2    b    B    y
4     3    c    C    z
5     3    c    C    z
6     3    c    C    z

In [30]:
dup_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [31]:
dup_obj.duplicated().sum()

4

In [32]:
dup_obj.drop_duplicates()

   col1 col2 col3 col4
0     1    a    A    x
2     2    b    B    y
4     3    c    C    z

In [33]:
dup_obj = DataFrame({'col1':[1,1,2,2,3,3,3],
                     'col2':['a','a','b','b','c','c','c'],
                     'col3':['A','A','B','B','C','D','C'],
                     'col4':['x','x','y','y','z','e','z']})
dup_obj
dup_obj.drop_duplicates(['col4'])

   col1 col2 col3 col4
0     1    a    A    x
2     2    b    B    y
4     3    c    C    z
5     3    c    D    e

### D. Concatenating and transforming data

In [34]:
concat_df_obj = DataFrame(np.arange(49).reshape(7,7))
concat_df_obj

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
5  35  36  37  38  39  40  41
6  42  43  44  45  46  47  48

In [35]:
concat_df_obj_2 = DataFrame(np.arange(15).reshape(3,5))
concat_df_obj_2

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

In [36]:
concatnated_obj = pd.concat([concat_df_obj,concat_df_obj_2], axis=1)
concatnated_obj

    0   1   2   3   4   5   6     0     1     2     3     4
0   0   1   2   3   4   5   6   0.0   1.0   2.0   3.0   4.0
1   7   8   9  10  11  12  13   5.0   6.0   7.0   8.0   9.0
2  14  15  16  17  18  19  20  10.0  11.0  12.0  13.0  14.0
3  21  22  23  24  25  26  27   NaN   NaN   NaN   NaN   NaN
4  28  29  30  31  32  33  34   NaN   NaN   NaN   NaN   NaN
5  35  36  37  38  39  40  41   NaN   NaN   NaN   NaN   NaN
6  42  43  44  45  46  47  48   NaN   NaN   NaN   NaN   NaN

In [37]:
concatnated_obj.drop([1,4,6]) # for row based deletion Default is without arguments for row based

    0   1   2   3   4   5   6     0     1     2     3     4
0   0   1   2   3   4   5   6   0.0   1.0   2.0   3.0   4.0
2  14  15  16  17  18  19  20  10.0  11.0  12.0  13.0  14.0
3  21  22  23  24  25  26  27   NaN   NaN   NaN   NaN   NaN
5  35  36  37  38  39  40  41   NaN   NaN   NaN   NaN   NaN

In [38]:
concatnated_obj.drop([1,4,6], axis=1) # for col based deletion

    0   2   3   5     0     2     3
0   0   2   3   5   0.0   2.0   3.0
1   7   9  10  12   5.0   7.0   8.0
2  14  16  17  19  10.0  12.0  13.0
3  21  23  24  26   NaN   NaN   NaN
4  28  30  31  33   NaN   NaN   NaN
5  35  37  38  40   NaN   NaN   NaN
6  42  44  45  47   NaN   NaN   NaN

In [39]:
series_obj

r1    15
r2     1
r3    15
r4     3
r5    15
r6     5
dtype: int32

In [40]:
series_obj_missing

0    NaN
1      b
2    NaN
3      c
4     10
5    236
6    NaN
7     we
dtype: object

In [41]:
series_obj.name = 'hello-python'
series_obj

r1    15
r2     1
r3    15
r4     3
r5    15
r6     5
Name: hello-python, dtype: int32

In [42]:
var_added_obj = DataFrame.join(df_obj,series_obj)
var_added_obj

          c1        c2        c3        c4        c5        r6  hello-python
r1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
r4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
r5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
r6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5

In [43]:
added_tables = var_added_obj.append(var_added_obj, ignore_index=False)
added_tables

          c1        c2        c3        c4        c5        r6  hello-python
r1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
r4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
r5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
r6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5
r1  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
r2  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
r3  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
r4  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
r5  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
r6  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5

In [44]:
added_tables = var_added_obj.append(var_added_obj, ignore_index=True)
added_tables

          c1        c2        c3        c4        c5        r6  hello-python
0   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
1   0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
2   0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
3   0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
4   0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
5   0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5
6   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
7   0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
8   0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
9   0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
10  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
11  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5

In [45]:
added_tables.sort_values(by=['c4'],ascending=True)

          c1        c2        c3        c4        c5        r6  hello-python
0   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
6   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
1   0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
7   0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
5   0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5
11  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5
3   0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
9   0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
2   0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
8   0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
4   0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
10  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15

In [46]:
added_tables.sort_values(by=['c4'],ascending=[False])   # Not giving best expected results;
                                                        # for that make sure col and row indexes are unique

          c1        c2        c3        c4        c5        r6  hello-python
4   0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
10  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935            15
2   0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
8   0.447031  0.585445  0.161985  0.520719  0.326051  0.699186            15
3   0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
9   0.366395  0.836375  0.481343  0.516502  0.383048  0.997541             3
5   0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5
11  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819             5
1   0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
7   0.684969  0.437611  0.556229  0.367080  0.402366  0.113041             1
0   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15
6   0.870124  0.582277  0.278839  0.185911  0.411100  0.117376            15

### E. Grouping and Data Aggregation

In [47]:
address = 'C:/Users/Arthur/python-learning/mtcars.csv'
data_cars = pd.read_csv(address)
#data_cars
data_cars.columns = ['car_name','mpg','cyl','disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am', 'gear', 'carb']
data_cars.head()    # .head() without arguement returns the 1st rows 
#data_cars.head(11)    #Any number argument returns that number of rows

,car_name,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [48]:
car_grp = data_cars.groupby(['cyl'])
car_grp.mean()

,mpg,disp,hp,drat,wt,qsec,vs,am,gear,carb
cyl,,,,,,,,,,
4,26.663636,105.136364,82.636364,4.070909,2.285727,19.137273,0.909091,0.727273,4.090909,1.545455
6,19.742857,183.314286,122.285714,3.585714,3.117143,17.977143,0.571429,0.428571,3.857143,3.428571
8,15.100000,353.100000,209.214286,3.229286,3.999214,16.772143,0.000000,0.142857,3.285714,3.500000

In [49]:
car_grp = data_cars.groupby(data_cars['cyl'])       #.groupby(data_cars['cyl']) and .groupby(['cyl'])
car_grp.mean()                                      #yields same results; which is better? I think the second!

,mpg,disp,hp,drat,wt,qsec,vs,am,gear,carb
cyl,,,,,,,,,,
4,26.663636,105.136364,82.636364,4.070909,2.285727,19.137273,0.909091,0.727273,4.090909,1.545455
6,19.742857,183.314286,122.285714,3.585714,3.117143,17.977143,0.571429,0.428571,3.857143,3.428571
8,15.100000,353.100000,209.214286,3.229286,3.999214,16.772143,0.000000,0.142857,3.285714,3.500000